In [ ]:
# 1) What are different collection datatypes in Python? How do they differ from one another?

# There are 4 different collection datatypes in Python which are List, Tuple, Dictionary, and Set, all with different
# qualities and usage.

# List items are ordered, changeable, and allow duplicate values.

# Tuples are very similar to lists, however, tuples are immutable meaning they can not be changed after they are 
# created. While lists are declared with brackets, tuples are declared with parentheses. We would use tuples to 
# present things that shouldn't be changed, such as days of the week, or dates on a calendar.

# Dictionaries are used to store data values in key:value pairs. Dictionary items are ordered, i.e, can be referred 
# using an index, changeable, i.e, we can change, add or remove items after the dictionary has been created, and 
# does not allow duplicates, i.e, dictionaries cannot have two items with the same key. The values in dictionary 
# items can be of any data type. Dictionary items are presented in key:value pairs, and can be referred to by using 
# the key name.

# Sets are used to store multiple items in a single variable. A set is a collection which is both unordered and 
# unindexed. Sets are written with curly brackets.

In [2]:
# import package
import pandas as pd

In [5]:
# 2) Create a DataFrame using a dictionary. Name the DataFrame as emp_df.
emp_dict = {'name':['Nancy', 'Andrew', 'Janet','Margaret', 'Steven'],
         'monthly_salary': [5000,4000,6000,3000,2000],
         'zip':[98122,98401,98033,98052,98051]}
emp_df = pd.DataFrame(emp_dict)
print(emp_df.head())

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [6]:
# 3) From emp_df print the first row
emp_df.iloc[0]

name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

In [7]:
# 4) From emp_df print the last row
emp_df.iloc[-1]

name              Steve
monthly_salary      2000
zip                98051
Name: 4, dtype: object

In [8]:
# 5) Print the shape of emp_df
emp_df.shape

(5, 3)

In [9]:
# 5) Print the size of emp_df
emp_df.size

15

In [10]:
# 6) Calculate the average salary for all the employees in emp_df
emp_df['monthly_salary'].mean()

4000.0

In [11]:
# 7) Sort the emp_df by name in ascending order
emp_df.sort_values(by = 'name')

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Stevem            2000  98051

In [12]:
# 8) Show only the row for employee who lives in zip code 98033
emp_df.loc[emp_df['zip'] == 98033]

    name  monthly_salary    zip
2  Janet            6000  98033

In [13]:
# 9) Create a new column annual_salary in emp_df using column monthly_salary
emp_df['annual_salary'] = emp_df['monthly_salary']*12

print(emp_df['annual_salary'])

0    60000
1    48000
2    72000
3    36000
4    24000
Name: annual_salary, dtype: int64

In [14]:
# 10) Rename the column name to firstname
emp_df.rename(columns = {'name':'firstname'}, inplace = True)

print(emp_df.head())

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Stevem            2000  98051          24000

In [15]:
# 11) Create another DataFrame named emp_info using emp_df but only choose columns firstname, and annual_salary, 
#     zip in it
emp_info = emp_df[['firstname','annual_salary','zip']]

print(emp_info.head())

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Stevem          24000  98051

In [16]:
# 12) Print only column firstname from emp_info
emp_info['firstname']

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Stevem
Name: firstname, dtype: object

In [17]:
# 13) Drop column annual_salary from emp_info
emp_info.drop(['annual_salary'], axis = 1)

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Stevem  98051